src/test/resources/jsonResponses/creditOperations/discountedCreditRights/discountedCreditRightsV2/contractPayments/invoiceFinancingContractPaymentsResponse(WrongRegexp).json

{
    "data": {
        "paidInstalments": 73,
        "contractOutstandingBalance": "1000.0400",
        "releases": [
            {
                "paymentId": "Parcela regular",
                "isOverParcelPayment": true,
                "instalmentId": "15",
                "paidDate": "2021-05-2$",
                "currency": "BRL",
                "paidAmount": "1000.0400",
                "overParcel": {
                    "fees": [
                        {
                            "feeName": "Excesso em Conta",
                            "feeCode": "EXCESSO_CONTA",
                            "feeAmount": "1000.0400"
                        }
                    ],
                    "charges": [
                        {
                            "chargeType": "JUROS_REMUNERATORIOS_POR_ATRASO",
                            "chargeAdditionalInfo": "Informações adicionais",
                            "chargeAmount": "1000.0400"
                        }
                    ]
                }
            }
        ]
    },
    "links": {
        "self": "https://api.banco.com.br/open-banking/api/v1/resource",
        "first": "https://api.banco.com.br/open-banking/api/v1/resource",
        "prev": "https://api.banco.com.br/open-banking/api/v1/resource",
        "next": "https://api.banco.com.br/open-banking/api/v1/resource",
        "last": "https://api.banco.com.br/open-banking/api/v1/resource"
    },
    "meta": {
        "totalRecords": 1,
        "totalPages": 1,
        "requestDateTime": "2021-05-21T08:30:00Z"
    }
}
